app/controllers/site/home_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`category` = 'Demo'
SELECT `products`.* FROM `products`
---
  def index
    if member_signed_in? && current_member.category != "Administrador"
      @products = Product.where(category: current_member.category)
    elsif member_signed_in? && current_member.category == "Administrador"
      @products = Product.all